<?php
// Heading
$_['heading_title']                        = 'Система «‎Frame»';
$_['text_heading_title']                   = '‎Frame. Панель управления';

// Buttons
$_['button_apply']                         = 'Применить и остаться';
$_['button_save']                          = 'Сохранить и выйти';
$_['button_cancel']                        = 'Выйти без сохранения';

$_['button_on']                            = 'Вкл.';
$_['button_off']                           = 'Выкл.';

$_['button_yes']                           = 'Да';
$_['button_no']                            = 'Нет';



$_['text_tab_settings']                    = 'Настройки';
$_['text_tab_help']                        = 'Информация';

$_['text_control_general_settings']        = 'Основные настройки';
$_['text_control_header_contacts']         = 'Контакты в шапке';
$_['text_control_main_menu_settings']      = 'Основное меню в шапке';
$_['text_control_help_menu_settings']      = 'Доп. меню в шапке';
$_['text_control_category_menu_settings']  = 'Меню категорий';
$_['text_control_search_settings']         = 'Настройки поиска';
$_['text_control_category_page_settings']  = 'Страница каталога';
$_['text_control_product_page_settings']   = 'Карточка товара';
$_['text_control_footer_settings']         = 'Подвал сайта';
$_['text_control_qview_settings']          = 'Быстрый просмотр';
$_['text_control_fastorder_settings']      = 'Быстрый заказ';
$_['text_control_modal_settings']          = 'Всплывающее окно';
$_['text_control_cust_code_settings']      = 'Коды счетчиков';
$_['text_control_color_scheme']            = 'Цвета и оформление';
$_['text_control_stikers_settings']        = 'Настройки стикеров';
$_['text_control_cust_css_settings']       = 'Пользователские стили';
$_['text_control_image_settings']          = 'Настройки изображений';
$_['text_control_performance_settings']    = 'Дополнительно';




// Text
$_['text_theme']                       = 'Темы';
$_['text_extension']                   = 'Расширения';
$_['text_success']                     = 'Настройки успешно изменены!';
$_['text_edit']                        = 'Редактирование';
$_['text_general']                     = 'Основное';
$_['text_product']                     = 'Товары';
$_['text_image']                       = 'Размеры изображений';





// Entry
$_['entry_directory']                  = 'Шаблон витрины';
$_['entry_status']                     = 'Статус системы';
$_['entry_high_definition_imgs']       = 'Изображения высокой чёткости';
$_['entry_product_limit']              = 'Лимит товаров в витрине';
$_['entry_product_description_length'] = 'Лимит символов';
$_['entry_image_category']             = 'Изображение в списке категорий';
$_['entry_image_manufacturer']         = 'Изображение в описании производителя';
$_['entry_image_thumb']                = 'Большое изображени товара';
$_['entry_image_popup']                = 'Popup изображения товара';
$_['entry_image_product']              = 'Изображения в списке товаров';
$_['entry_image_additional']           = 'Доп. изображения товара';
$_['entry_image_related']              = 'Изображения аналогичных товаров';
$_['entry_image_compare']              = 'Изображения в списке сравнения';
$_['entry_image_wishlist']             = 'Изображения в списке закладок';
$_['entry_image_cart']                 = 'Изображения товаров в корзине';
$_['entry_image_location']             = 'Изображение магазина';
$_['entry_width']                      = 'Ширина';
$_['entry_height']                     = 'Высота';

// Help
$_['help_high_definition_imgs']        = 'Вкючение этой опции увеличит объем кэша, что может потребовать увеличения дискового пространства на сервере для магазинов с большим количеством товаров. Но благодаря этому изображнеия не будут выглядеть размыто на устройстввах в высокой плотностью пикселей (смартфоны, планшеты, ретина дисплеи).';
$_['help_directory']                   = 'В указанном поле вы можете выбрать директорию темы';
$_['help_product_limit']               = 'Определяет, сколько товаров отображаются на странице (Список товаров).';
$_['help_product_description_length']  = 'Количество символов в кратком описании товара (Список товаров)';

// Error
$_['error_permission']                 = 'У Вас нет прав для изменения настроек!';
$_['error_limit']                      = 'Укажите лимит!';
$_['error_image_thumb']                = 'Необходимо указать размер большого изображения товара!';
$_['error_image_popup']                = 'Необходимо указать размер всплывающего изображения товара!';
$_['error_image_product']              = 'Необходимо указать размер изображения в списке товаров!';
$_['error_image_category']             = 'Необходимо указать размер изображения в списке категорий!';
$_['error_image_additional']           = 'Необходимо указать размер дополнительных изображений товара!';
$_['error_image_related']              = 'Необходимо указать размер изображения аналогичных товаров!';
$_['error_image_compare']              = 'Необходимо указать размер изображения в списке сравнения!';
$_['error_image_wishlist']             = 'Необходимо указать размер изображения в списке закладок!';
$_['error_image_cart']                 = 'Необходимо указать размер изображения товара в корзине!';
$_['error_image_location']             = 'Необходимо указать размер изображения магазина!';

$_['scss_parse_error']                 = ' Но не удалсь сформировать цветовую схему! Проверьте настройки схемы на ошибки. Компилятор вернул следующую ошибку: ';



$_['lg_text_text']             = 'Текст';
$_['lg_text_link']             = 'Ссылка';
$_['lg_text_sort']             = 'Сортировка';



$_['l_err_domain']             = '<b>Ошибка лицензии!</b> Домен <b>%s</b> не активирован. За дополнитеьной информацией обратитесь к <a href="http://xds.by" target="_blank">разработчику</a>';
$_['l_err_file_count']         = 'В каталоге <b>%slicense/</b> должен быть только 1 файл с лицензией для XDS Frame';
$_['l_err_config']         		 = 'Домены не совпадают. Возможно в <b>config.php</b> указан домен отличный от <b>%s</b>';
$_['l_err_folder_crate']       = 'Не удалось создать директорию <b>%s</b>. Создайте её самостоятельно';
$_['l_err_folder_write']       = 'Директория <b>%s</b> недоступна для записи. Установите необходимые права';


// icons in module list
$_['heading_title']             .= ' <a href="https://xds.by/" target="_blank"><svg fill="#ddd" style="float:right;margin:-2px 4px;transition: all ease .2s" onmouseover="this.setAttribute(\'fill\', \'#dc3545\')" onmouseout="this.setAttribute(\'fill\', \'#ddd\')" width="22" height="22" viewBox="0 0 1080 1080"><path d="M269.3 117.8c-65.8 64.1-127.4 130.2-183 196.3-1.1 1.4 9.1 11.6 82.2 82 46 44.2 83.9 80.5 84.4 80.7 1.1.4 50.7-50.1 74-75.3 34-36.8 70-78.4 109.9-127.2l22.3-27.3-7.7-11.2c-38.7-56.7-79.3-99.1-133.4-139.7-6.9-5.2-13-9.8-13.7-10.3-.8-.7-11.3 8.9-35 32zM663.3 191.8C528.6 325.8 371.4 484.6 180.1 680c-28.3 28.9-59.9 61.1-70.3 71.5l-18.8 19 14.1 17c71.4 85.6 134.5 146.4 213 204.9l3.7 2.7L427.6 883c58.2-61.6 106.1-111.9 106.5-111.8.4.2 54.8 48.9 121 108.3 66.1 59.4 120.9 108.1 121.6 108.3 3.2.8 36.1-24.6 57-44 19-17.7 37-37.3 73.8-80.8 28.5-33.6 43.4-49.7 66.7-72.6l20.6-20-108.2-105.1c-59.4-57.9-109.8-107-112-109.1l-3.8-4 3.6-6.9c9.3-17.4 23.1-33.6 49.9-58 33.8-30.8 68-63.5 115.9-111.3l48.8-48.5-4.9-11.5c-16.4-39.1-40-75.4-67.5-103.9-12.1-12.5-32.7-31-56.9-51.3-44.3-37-80.2-60.2-97.7-63.2l-3.5-.5-95.2 94.7z"/></svg></a>';
